CREATE TABLE IF NOT EXISTS students
(
    id  SERIAL PRIMARY KEY,
    FIO TEXT,
    dob DATE
);

INSERT INTO students (FIO, dob)
VALUES ('Іванов Іван Іванович', '1995-03-15'),
       ('Петров Петро Петрович', '1998-07-20'),
       ('Сидорова Ольга Василівна', '2000-01-05'),
       ('Коваленко Марія Сергіївна', '1997-09-10'),
       ('Григоренко Олег Павлович', '1999-12-25'),
       ('Смирнова Анна Олександрівна', '1996-04-30'),
       ('Бондаренко Олексій Вікторович', '2002-11-12'),
       ('Козлова Ірина Петрівна', '1994-06-08'),
       ('Морозов Дмитро Михайлович', '1993-02-19'),
       ('Захаренко Тетяна Ігорівна', '2001-08-07');

